change graph to mermaid format which renders natively on GitHub
